#include "Class.h"

GAME::GAME(const InitData& init)
	: IScene{ init }
{
	init_country();
	init_color();

	String temp;
	for (int i = 0; i < country_size; i++)
	{
		int r = Random(country_size - 1);
		temp = country[i];
		country[i] = country[r];
		country[r] = temp;
	}

	for (int i = 0; i < 100; i++)
	{
		war << country[i];

		for (int j = 0; j < 10; j++)
		{
			for (int k = 0; k < 10; k++)
			{
				map[j][k] = Rect(0 + 50 * k, 0 + 50 * j, 50, 50);
				territory << Rect(0 + 50 * k, 0 + 50 * j, 50, 50);
			}
		}
	}
}

GAME::~GAME()
{

}

void GAME::update()
{

}

void GAME::draw() const
{
	for (int i = 0; i < 100; i++) {
		territory[i].draw(colors[i]);
	}

	for (int j = 0; j < 10; j++)
	{
		for (int k = 0; k < 10; k++)
		{
			if (map[j][k].mouseOver())
			{
				Rect(map[j][k]).drawFrame(2, 2, ColorF(1.0, 0.6, 0.0));
			}
		}
	}
}

void GAME::init_country()
{
	country = { U"日本",
		U"ニュージーランド",
		U"ネパール",
		U"ノルウェー",
		U"バーレーン",
		U"ハイチ",
		U"パキスタン",
		U"パラオ",
		U"パラグアイ",
		U"バルバドス",
		U"ハンガリー",
		U"バングラデシュ",
		U"東ティモール",
		U"フィジー",
		U"フィリピン",
		U"フィンランド",
		U"ブータン",
		U"ブラジル",
		U"フランス",
		U"ブルガリア",
		U"ブルキナファソ",
		U"ブルネイ",
		U"ブルンジ",
		U"ベトナム",
		U"ベナン",
		U"ベネズエラ",
		U"ベラルーシ",
		U"ベリーズ",
		U"ペルー",
		U"ベルギー",
		U"ポーランド",
		U"ボスニア",
		U"ボツワナ",
		U"ボリビア",
		U"ポルトガル",
		U"ホンジュラス",
		U"マーシャル諸島",
		U"マダガスカル",
		U"マラウイ",
		U"マリ",
		U"マルタ",
		U"マレーシア",
		U"ミクロネシア",
		U"南アフリカ",
		U"南スーダン",
		U"ミャンマー",
		U"メキシコ",
		U"モーリシャス",
		U"モーリタニア",
		U"モザンビーク",
		U"モナコ",
		U"モルディブ",
		U"モルドバ",
		U"モロッコ",
		U"モンゴル",
		U"モンテネグロ",
		U"ヨルダン",
		U"ラオス",
		U"ラトビア",
		U"リトアニア",
		U"リビア",
		U"リヒテンシュタイン",
		U"リベリア",
		U"ルーマニア",
		U"ルクセンブルク",
		U"ルワンダ",
		U"レソト",
		U"レバノン",
		U"ロシア",
		U"アイスランド",
		U"アイルランド",
		U"アゼルバイジャン",
		U"アフガニスタン",
		U"アメリカ",
		U"アラブ首長国",
		U"アルジェリア",
		U"アルゼンチン",
		U"アルバニア",
		U"アルメニア",
		U"アンゴラ",
		U"アンドラ",
		U"イエメン",
		U"イスラエル",
		U"イタリア",
		U"イラク",
		U"イラン",
		U"インド",
		U"インドネシア",
		U"ウガンダ",
		U"ウクライナ",
		U"ウズベキスタン",
		U"ウルグアイ東方",
		U"エクアドル",
		U"エジプト",
		U"エストニア",
		U"エスワティニ",
		U"エチオピア",
		U"エリトリア",
		U"エルサルバドル",
		U"オーストラリア",
		U"オーストリア",
		U"オマーン",
		U"オランダ",
		U"ガーナ",
		U"カーボヴェルデ",
		U"ガイアナ",
		U"カザフスタン",
		U"カタール",
		U"カナダ",
		U"ガボン",
		U"カメルーン",
		U"ガンビア",
		U"カンボジア",
		U"北マケドニア",
		U"ギニアビサウ",
		U"ギニア",
		U"キプロス",
		U"キューバ",
		U"ギリシャ",
		U"キリバス",
		U"キルギス",
		U"グアテマラ",
		U"クウェート",
		U"クック諸島",
		U"イギリス",
		U"グレナダ",
		U"クロアチア",
		U"ケニア",
		U"コートジボワール",
		U"コスタリカ",
		U"コモロ",
		U"コロンビア",
		U"コンゴ",
		U"コンゴ",
		U"サウジアラビア",
		U"サモア",
		U"ザンビア",
		U"サンマリノ",
		U"シエラレオネ",
		U"ジブチ",
		U"ジャマイカ",
		U"ジョージア",
		U"シリア",
		U"シンガポール",
		U"ジンバブエ",
		U"スイス",
		U"スウェーデン",
		U"スーダン",
		U"スペイン",
		U"スリナム",
		U"スリランカ",
		U"スロバキア",
		U"スロベニア",
		U"セーシェル",
		U"赤道ギニア",
		U"セネガル",
		U"セルビア",
		U"セントルシア",
		U"ソマリア",
		U"ソロモン",
		U"タイ",
		U"大韓民国",
		U"タジキスタン",
		U"タンザニア",
		U"チェコ",
		U"チャド",
		U"中央アフリカ",
		U"中国",
		U"チュニジア",
		U"チリ",
		U"ツバル",
		U"デンマーク",
		U"ドイツ",
		U"トーゴ",
		U"ドミニカ",
		U"ドミニカ",
		U"トリニダード・トバゴ",
		U"トルクメニスタン",
		U"トルコ",
		U"トンガ",
		U"ナイジェリア",
		U"ナウル",
		U"ナミビア",
		U"ニウエ",
		U"ニカラグア",
		U"ニジェール",
		U"日本",
		U"ニュージーランド",
		U"ネパール",
		U"ノルウェー",
		U"バーレーン",
		U"ハイチ",
		U"パキスタン",
		U"バチカン",
		U"パナマ",
		U"バヌアツ",
		U"バハマ" };

		country_size = country.size();
}

void GAME::init_color()
{
	for (int i = 0; i < 10; i++)
	{
		colors << ColorF(1.0, 0.0, 0.0);
		colors << ColorF(1.0, 0.1, 0.3);
		colors << ColorF(1.0, 0.0, 0.6);
		colors << ColorF(0.8, 0.0, 0.8);
		colors << ColorF(1.0, 0.3, 0.0);
		colors << ColorF(1.0, 0.5, 0.0);
		colors << ColorF(1.0, 0.8, 0.0);
		colors << ColorF(0.5, 0.8, 0.0);
		colors << ColorF(0.0, 0.5, 1.0);
		colors << ColorF(0.53, 0.8, 0.9);
	}
}
